[" \nFormula One  \ni \n \n \nAbout the Tutorial  \nFormula One racing, also known as F1 racing, is the principal form of motor sport, \nusually associated with the thrill and excitement of speed racing . This tutorial \nexplains all the elements involved in F1 raci", "g . This tutorial \nexplains all the elements involved in F1 racing, such as the rules and  regulations \nand the essential gears involved in the sport. A brief on the best -in-class racers is \nalso provided at the conclusion of the document.  \n \nThe informa", "also provided at the conclusion of the document.  \n \nThe information here is meant to supplement your knowledge on the sport. \nHowever, it is not a comprehensive  guide on how to play the sport.  \nAudience  \nThis tutorial is meant for those w ho want to kn", "t.  \nAudience  \nThis tutorial is meant for those w ho want to know all about Formula One racing . \nIt is prepared keeping in mind that the reader is unaware about the basics of the \nsport. It is a basic guide to help a beginner unders tand the sport.  \nPre", "is a basic guide to help a beginner unders tand the sport.  \nPrerequisites  \nBefore proceeding with this tutorial, you are required to have a passion for the \nsport and an eagerness to acquire knowledge on the same.  \nCopyright & Disclaimer  \n Copyright 2", " knowledge on the same.  \nCopyright & Disclaimer  \n Copyright 20 22 by Tutorials Point (I) Pvt. Ltd.  \n \nAll the conte nt and graphics published in this e -book are the property of Tutorials \nPoint (I) Pvt. Ltd. The user of this e -book is prohibited to r", "\nPoint (I) Pvt. Ltd. The user of this e -book is prohibited to reuse, retain, copy, \ndistribute, or republish any contents or a part of contents of this e -book in any \nmanner without writte n consent of the publisher.  \n \nWe strive to update the contents ", " consent of the publisher.  \n \nWe strive to update the contents of our website and tutorials as timely and as \nprecisely as possible, however, the contents may contain inaccuracies or errors. \nTutorials Point (I) Pvt. Ltd. provides no guarantee regarding t", "\nTutorials Point (I) Pvt. Ltd. provides no guarantee regarding the accuracy, \ntimeliness, or completeness of our website or its contents including this tutorial. \nIf you discover any errors on our website or in this tutorial, please notify us at \ncontact@t", " our website or in this tutorial, please notify us at \ncontact@tutorialspoint.com  \n \n Formula One  \nii \n \n \nTable of Contents  \nFormula One, also called F1 in short, is an international auto racing sport . F1 is ", "lled F1 in short, is an international auto racing sport . F1 is \nthe highest level of single -seat, open -wheel  and op en-cockpit  professional motor \nracing contest.   \n \nFormula One racing is governed and sanctioned by a world body called the FIA - \nFéd", "is governed and sanctioned by a world body called the FIA - \nFédération Internationale de l'Automobile  or the International Automobile \nFederation . The name ‘Formula’ comes  from the set of ru les that the participating \ncars and drivers must follow.  \nO", "ru les that the participating \ncars and drivers must follow.  \nObjective  \nThe objective of a Formula 1 contest is to determine the winner of a race. The \ndriver who crosses the finish line first after completing a pre -determined number \nof laps is declar", "rst after completing a pre -determined number \nof laps is declared the winn er.  \n \n \n \nKnow more about F1 racing and its rules, regulations, contests and other details  \nby reading further . \n1. FORMULA ONE – A RACI NG SPORT  Formula One  \n2 \n \n \nFormula ", "\n1. FORMULA ONE – A RACI NG SPORT  Formula One  \n2 \n \n \nFormula One – History & Team Size  \nFormula 1 racing originated during the 1920 -30s in Europe from other similar \nracing competitions. In 1946, the FIA standardized racing rules and this formed \nthe ", "In 1946, the FIA standardized racing rules and this formed \nthe basis of Formula One racing.  The inaugural Formula One World Drivers’ \nchampionship was then held in 1950, the first world championship series.  \n \nApart fro m the world championship series, ", "pionship series.  \n \nApart fro m the world championship series, many other non -championship F1 races \nwere also held, but as the costs of conducting these contests got higher , such \nraces were discontinued after 1983.  \n \nEach F1 team can have maximum of", "re discontinued after 1983.  \n \nEach F1 team can have maximum of four drivers per season. Th ere is support staff \nwith every F1 team that play s a vital role in the team’s success.  \n Formula One  \n3 \n \n \nA series of Formula One races are conducted over a", " One  \n3 \n \n \nA series of Formula One races are conducted over a period of time, usually over a \nyear called the ‘F ormula One  World Championship season’ . Each race in a season \nis called a ‘ Grand Prix ’ or GP and all the races in a season combined are ", "‘ Grand Prix ’ or GP and all the races in a season combined are called \n‘Grands Prix’ (plural of Grand Prix).  \n \nThe term ‘Grand Prix’ is derived from French which means ‘great prize’.  \nParticipating Countries  \nDrivers from the following countries have ", "icipating Countries  \nDrivers from the following countries have participated in Formula One races as of \n2015:  \n \n1. Argentina  \n2. Australia  \n3. Austria  \n4. Bahrain  \n5. Belgium  \n6. Brazil  \n7. Canada  \n8. Chile \n9. Colombia  \n10.Czech Republic  \n11.D", "l  \n7. Canada  \n8. Chile \n9. Colombia  \n10.Czech Republic  \n11.Denmark  \n12.East Germany  \n13.Finland  \n14.France  \n15.Germany  \n16.Hungary  \n17.India  \n18.Ireland  \n19.Italy  \n20.Japan  \n21.Liechtenstein  22.Malaysia  \n23.Mexico  \n24.Monaco  \n25.Morocco  ", "iechtenstein  22.Malaysia  \n23.Mexico  \n24.Monaco  \n25.Morocco  \n26.Netherlands  \n27.New Zealand  \n28.Poland  \n29.Portugal  \n30.Rhodesia  \n31.Rhodesia and Nyasaland  \n32.Russia   \n33.South Africa  \n34.Spain  \n35.Sweden  \n36.Switzerland  \n37.Thailand  \n38.U", "ica  \n34.Spain  \n35.Sweden  \n36.Switzerland  \n37.Thailand  \n38.United Arab Emirates  \n39.United Kingdom  \n40.United States  \n41.Uruguay  \n42.Venezuela  \n \n \n \n \n \n \n \n \n 2. FORMULA ONE  – PARTICIPATING COUNTR IES Formula One  \n4 \n \n \nConstructors  from the", "ICIPATING COUNTR IES Formula One  \n4 \n \n \nConstructors  from the following countries have participated  in Formula One races \nas of 2015:  \n \n1. Brazil  \n2. Canada  \n3. East Germany  \n4. France  \n5. Germany  \n6. Hong Kong  \n7. Italy  \n8. Japan  \n9. Malaysi", "e  \n5. Germany  \n6. Hong Kong  \n7. Italy  \n8. Japan  \n9. Malaysia  10.Netherlands  \n11.New Zealand  \n12.Rhodesia  \n13.South Africa  \n14.Spain  \n15.Switzerland  \n16.United Kingdom  \n17.United States  \n \n \nThe following countrie s are hosts for  Formula One ", "tates  \n \n \nThe following countrie s are hosts for  Formula One races in 2015:  \n \n1. Argentina  \n2. Australia  \n3. Austria  \n4. Bahrain  \n5. Belgium  \n6. Brazil  \n7. Canada  \n8. China  \n9. France  \n10.Germany  \n11.Hungary  \n12.India  \n13.Italy  \n14.Japan ", "ance  \n10.Germany  \n11.Hungary  \n12.India  \n13.Italy  \n14.Japan  \n15.Malaysia  \n16.Mexico  17.Monaco  \n18.Morocco  \n19.Netherlands  \n20.Portugal  \n21.Russia  \n22.Singa pore  \n23.South Africa  \n24.Republic of Korea  \n25.Spain  \n26.Sweden  \n27.Switzerland  \n", "\n24.Republic of Korea  \n25.Spain  \n26.Sweden  \n27.Switzerland  \n28.Turkey  \n29.United Arab Emirates  \n30.United Kingdom  \n31.United States  \nNumber of Grand  Prix in a Season  \nThe number of Grand  Prix in a season has varied through the years,  starting f", "rand  Prix in a season has varied through the years,  starting from \n1950 which had 7 races . This number kept increasing up to a maximum of 20 GPs \na year (in 2012).  Normally there are 19 to 20 GPs in a season now. The 20 15 F1 \nseason has 19 Grand  Prix", " 20 GPs in a season now. The 20 15 F1 \nseason has 19 Grand  Prix, out of which 8 have been completed.  \nGrand  Prix Naming  \nEach G P in a season is hosted by a different country  and are named after the host \ncountry. Example: A GP held in Australia is ca", "d after the host \ncountry. Example: A GP held in Australia is called an Australian Grand Prix, that \nheld in Monaco is called the Monaco Grand Prix and so on. However, a GP can be \nheld in same or different cities of the host country  every year . Formula ", "e or different cities of the host country  every year . Formula One  \n \n5 \n \n \nGrand Prix Racing Distance  \nThe minimum total distance of a Grand Prix race, including all the pre -defined \nnumber of laps must be  300 km or 190 miles. This is the standard d", "ber of laps must be  300 km or 190 miles. This is the standard distance for all \nraces  except for the Monaco GP which  is 260 km or 160 miles. \nNumber of Teams in F1 World Championship  \n10 teams with two cars each are permitted to compete in the F1 World", "eams with two cars each are permitted to compete in the F1 World \nChampionship as of 2015. That is, a total of 20 cars can enter the competition. \nHowever, the FIA regulations allow a l imit of 26 cars for the championship.  \nGrand Prix World Championships", "f 26 cars for the championship.  \nGrand Prix World Championships  \nThe results of all the Grand Prix races in a season are taken together to determine \ntwo annual Championship awards. They are:  \n \n1. Drivers' Championship Award (for the drivers)  \n2. Cons", ":  \n \n1. Drivers' Championship Award (for the drivers)  \n2. Constructors' Championship Award (for the constructors)  \nThe terms ‘drivers’ and ‘constructors’ are explained in later chapters . Formula One  \n \n6 \n \n \nA Formula One car is an open -wheel, open ", "ormula One  \n \n6 \n \n \nA Formula One car is an open -wheel, open -cockpit, single -seat racing car for the \npurpose of being used in Formula One competitions. It is equipped with two wings \n(front and rear) plus an engine, which is located behind the driver", "ont and rear) plus an engine, which is located behind the driver.  \n \nThe F1 races are conducted on specifically built racing tracks called ‘circuits’. \nSometimes they are conducted on closed public  roads as well.  \n \n \nConstruction  \nEvery F1 car is comp", "public  roads as well.  \n \n \nConstruction  \nEvery F1 car is composed of two main components - the chassis and the engine.  \n \nChassis:  Formula One cars these days are made from carbon fiber and ultra -\nlightweight components. The weight must be not less t", "nd ultra -\nlightweight components. The weight must be not less than 702 kg or 154 8 lbs, \nincluding the driver and tires, but excluding the fuel.  \n \nThe dimensions of a Formula One car must be maximum 180 cm ( width ) x 95cm \n(height); there is no specifi", "e maximum 180 cm ( width ) x 95cm \n(height); there is no specified number for maximum length, but all cars tend to \nbe of almost the same length.  \n \nEngine:  According to regulation changes in 2014, all F1 cars must deploy 1.6 liter \nturbocharged V6 engin", "n 2014, all F1 cars must deploy 1.6 liter \nturbocharged V6 engines.  \n3. FORMULA ONE CAR – DESIGN, SPECS, RULES  Formula One  \n \n7 \n \n \nGearbox  \nSemi-automatic sequential carbon titanium gearboxes are used by F1 cars  \npresently, with 8 forward gears and ", "boxes are used by F1 cars  \npresently, with 8 forward gears and 1 reverse gear, with rear -wheel dr ive. \nSteering Wheel  \nThe steering wheel of an F1 car is equipped to perform many functions like \nchanging gears, changing brake pressure, calling the rad ", " like \nchanging gears, changing brake pressure, calling the rad io, fuel adjustment, and \nso on.  \nFuel \nThe fuel used by Formula One cars is a tightly controlled mixture of  ordinary petrol, \nand can only contain commercial gasoline compounds rather than ", "\nand can only contain commercial gasoline compounds rather than alcohol \ncompounds.  \nTires \nFormula One cars have been using smooth thread, slick t ires since 2009. The t ire \ndimensions of an F1 car are:  \n \n Front T ire - 245mm (width)  \n Rear Tires -", "n F1 car are:  \n \n Front T ire - 245mm (width)  \n Rear Tires - 355mm and 380mm (width)  \nBrakes  \nFormula One cars use disc brakes with a rotor and caliper at each t ire. \nSpeed and Performance  \nAll F1 cars can accelerate from 0 to 100 mph (160 kmph) an", "nce  \nAll F1 cars can accelerate from 0 to 100 mph (160 kmph) and decelerate back to \n0 in under 5 seconds. F1 cars have r eached top speeds of about 300 kmph or 185 \nmph on an average.  \n \nHowever, some cars, without fully complying with F1 standards have", "wever, some cars, without fully complying with F1 standards have attained \nspeed  of 400 kmph or more. These numbers are mostly same for all F1 cars but \nslight variations may exist due to the gears and aerodynamics configuration.  \n \n Formula One  \n \n8 \n ", " gears and aerodynamics configuration.  \n \n Formula One  \n \n8 \n \n \nSafety is high priority in motor sports. Formula One has seen many tragedies in \nits early days with many casualties that included drivers and spectators as cars \ncrashed at high spe eds. E", "luded drivers and spectators as cars \ncrashed at high spe eds. Engineers researched using latest technology to build \nsafer cars and gear for drivers. This has certainly reduced the number of incidents \nover the last decade. Let’s know about the different ", "incidents \nover the last decade. Let’s know about the different safety gears used by drivers \nin this chapter.  \n \nHelmets : Helmets are compulsory in F1 \nraces. Their built is very strong and light so \nthat it doesn’t add extra weight on driver’s \nhead at", " light so \nthat it doesn’t add extra weight on driver’s \nhead at high speeds. These are fire resistant \nalso. Of course, the helmets have to meet FIA \nstandards. The helmet comprises of several \nlayers that undergo severe tests. Normally, \nthe weight of th", "l \nlayers that undergo severe tests. Normally, \nthe weight of the helmet is around 1.2 kg. \nInterestingly, the helmets of F1 are painted \nby hand.  \n \nHANS : HANS stands for Head and Neck Support. The purpose of HANS is to \nprotect the driver’s vertebrae a", "ort. The purpose of HANS is to \nprotect the driver’s vertebrae and collision of head to the steering wheel in case \nof an accident. It is built using carbon fiber material and is attached to the seat \nbelt in the cockpit. It is coupled with elastic straps.", "he seat \nbelt in the cockpit. It is coupled with elastic straps. HANS was inducted by FIA \nafter a major collision in 1995, Austra lian GP.  \n \n \nClothing : The clothing of F1 drivers is \ndesigned to protect them from fire accidents \nin case of crash. It i", "gned to protect them from fire accidents \nin case of crash. It is a multilayered suit that \nmatches specifications of NASA.  \n \nNomex is the latest fiber material brand used \nto build suits for F1 driver s. The suit \nundergoes thermal testing; it is fire r", "r F1 driver s. The suit \nundergoes thermal testing; it is fire resistant \nand lightweight. The suit is worn by the pit \ncrew also. The outfit is washed and dry -\ncleaned multiple times before undergoing tests. There are two handles on \nshoulders of suit so", "undergoing tests. There are two handles on \nshoulders of suit so that it can be st rapped with seat. This allows the pit crew to \npull the driver out in one piece with seat during a crash to reduce injuries.  Nomex \nfiber can survive temperatures up to 700", "educe injuries.  Nomex \nfiber can survive temperatures up to 700 -800 degree Celsius for more than 10 \nseconds.  4. FORMULA ONE – SAFETY  GEAR  \nFormula One  \n \n9 \n \n \nThis chapte r consists of all the popular terminology used in Formula One. It is to \nund", "f all the popular terminology used in Formula One. It is to \nunderstand the language of the sport better.  \n \n107% rule – A driver should not exceed 107 percent of fastest time in qualifying \nsession; if he fails to do so , then he is not allowed to  start", "session; if he fails to do so , then he is not allowed to  start the race. He is allowed \nto start if he sets a suitable time during the practice session.  \n \nBackmarker – The drivers lagging behind are called backmarkers. They are \nshown blue flag to give", "behind are called backmarkers. They are \nshown blue flag to give way for leading drivers.  \n \nBlistering – Improper selection of t ire compound can cause excess heat that can \nlead to chunks of rubber breaking off from the t ire. This is called blistering.", "f rubber breaking off from the t ire. This is called blistering.  \n \nCockpit – The seating area of the driver in a F1 car is called the cockpit.  \n \nDelta Time – The difference of time between two laps or two cars is referred to \nas delta time.  \n \nDrive -", " two laps or two cars is referred to \nas delta time.  \n \nDrive -through penalty – A penalty imposed for minor offence or violation of \nrules on  track. It requires the driver to drive at a minimum speed and enter the \npit lane  witho ut stopping . The driv", "imum speed and enter the \npit lane  witho ut stopping . The driver is allowed to re-join the race.  \n \nFlat spot – The portion of the t ire where it is heavily worn out due to spin or \nextreme breaking  is called the flat spot . \n \nFormation lap or warm -u", " breaking  is called the flat spot . \n \nFormation lap or warm -up lap – Cars are driven for a lap from the gr id before \nthe start of the race  and then get back to grid positions.  This is known as the \nwarm -up lap.  \n \nJump start – Sensors are installed", "own as the \nwarm -up lap.  \n \nJump start – Sensors are installed at grid positions to monitor the cars that start \nbefore all the red lights go off signaling the start of race. Such s tart is called jump \nstart and the driver earns a penalty for it.  \n \nLo", "called jump \nstart and the driver earns a penalty for it.  \n \nLollipop – The sign board at the pit stop that signals the driver to apply brakes \nand stay in first gear before the car is lowered from jacks.  \n \nParc ferme – A restricted area where no team m", "d from jacks.  \n \nParc ferme – A restricted area where no team m embers are allowed and all race \ncars are driven here after completion of practice or race. This area is supervised \nby race stewards only.  \n \nPit board – A board held at pit wall to inform ", "ewards only.  \n \nPit board – A board held at pit wall to inform the driver about delta time, \nremaining number of laps, and current pos ition. \n \nPit wall – It is F1 team area where the manager, engineers, and support staff \nkeep close watch on their cars ", "r, engineers, and support staff \nkeep close watch on their cars using small screens under a shelter.  5. FORMULA ONE – POPULAR TERMS  Formula One  \n \n10 \n \n \n \nPit – An area of the track separated by a wall. Cars enter team’s pit garage for \nchange of whee", "ated by a wall. Cars enter team’s pit garage for \nchange of wheels, r efuel the car, and set  up other changes.  \n \nPole position – Driver who recorded fastest time during qualifying session is \nawarded the first grid position on race day.  \n \nSteward – A ", "s \nawarded the first grid position on race day.  \n \nSteward – A high -ranked official appointed for races to make decisions.  \n \nTire warmer – An electronic blanket is wrapped around the t ires before cars are \npositioned for race that keeps them at optimu", "s before cars are \npositioned for race that keeps them at optimum temperatures before the start of \nthe race. \n \nVisor strip – The top edge of helmet needs extra protection and it is provided \nwith a visor strip m ade of Zylon that is a high-resistant carb", "\nwith a visor strip m ade of Zylon that is a high-resistant carbon fiber material.  \n \nConstructor – Since 1981, FIA has passed a rule that respective F1 teams have \nto build their own engine and chassis of the car. The owner of the engine and \nchassis is ", "and chassis of the car. The owner of the engine and \nchassis is called the constructor.  \n \nCircuit - Formula One circuits are tracks specifically and purposefully built for \nconducting races. F1 circuits are of two types – Street Circuit and Road Circuit.", " F1 circuits are of two types – Street Circuit and Road Circuit.  Formula One  \n \n11 \n \n \nA Formula One race sta rts with a warm -up lap, called the formation lap and the \npit lanes are opened of this purpose 30 minutes before the actual race begins. Pit \n", " of this purpose 30 minutes before the actual race begins. Pit \nlanes are tracks away from the grid and are parallel to the start/finish line.  \n \nDuring this time , the drivers are fr ee to take any number of warm -up drives, \nwithout actually going on th", "ake any number of warm -up drives, \nwithout actually going on the grid. After the pit lane closes, the drivers must take \ntheir places on the grid in their qualifying order.  \n \nOnce all the cars have taken their positions on the grid, the race begins wit ", "ars have taken their positions on the grid, the race begins wit h the \nstarting lights - 10 re d lights in 5 pairs of columns.  \n \nEach column lights on e after the other, at an interval of 1 second from left to right \ndirection. After all, 5 columns are i", "second from left to right \ndirection. After all, 5 columns are illuminated, they stay in that wa y for a few \nseconds and then all of them are extinguished at once and the race begins.  \n \nIf the start is interrupted due to any circumstances, the 5 red lig", "the start is interrupted due to any circumstances, the 5 red lights illuminate \nagain but are not extinguished, instead orange lights are lit up  and the race is \nrestarted.  \n \nThe drivers who finish at first, second and third positions at the end of the ", "o finish at first, second and third positions at the end of the race \nstand on a podium and are awarded trophies. A constructor's trophy is also \npresented to the winner's team.   \nRace Distance and Duration  \nThe length of the rac e must be 305 km (260 km", "ce and Duration  \nThe length of the rac e must be 305 km (260 km in case of Monaco GP) and is \ndefined as \"the smallest number of complete laps that exceeds 305 kilometers\".  \n \nThe number of laps in a race is obtained by dividing 305 by the length of a la", "laps in a race is obtained by dividing 305 by the length of a lap, \nwhich differs from track to track.   \n \nThe duration of the race cannot be more than 2 hours. If the allocated time of 2 \nhours is exceeded, the race is considered to be finished at the en", "urs is exceeded, the race is considered to be finished at the end of the ongoing \nlap. \nRefueling  \nRefueling during races was allowed earlier, but from 2010 this has been aboli shed. \nAs a result, every car must ensure a loaded tank be fore the race begin", "sult, every car must ensure a loaded tank be fore the race begins. However, \nrefueling during races will be permitted again from the 2017 season.  6. FORMULA ONE – RULES & REGULATION S Formula One  \n \n12 \n \n \nRacing Flags  \nSimilar to motor sports and othe", " One  \n \n12 \n \n \nRacing Flags  \nSimilar to motor sports and other racing competitions, racing flags are used in \nFormul a One to send out various messages and signal s to the drivers like the race \nstart or finish, lap indication, bad weather indication, e", "race \nstart or finish, lap indication, bad weather indication, etc.  \n \nThree categories of flags are used in F1 racing. They are:  \n \n Status Flags  \n Instruction Flags  \n The Chequered Flag  \nStatus Flags  \nThere are 5 status flags – \n \n1. Green Flag ", "ag  \nStatus Flags  \nThere are 5 status flags – \n \n1. Green Flag : It is used to indicate the start of a race or the restart of a race \nstopped due to a temporary delay.  \n \n2. Yellow Flag : It is an indication of caution to the drivers to go slow due to \ns", " is an indication of caution to the drivers to go slow due to \nsome accident or haza rd on the track or due to rain.  \n \n3. Red Flag : It is an indication of danger, especially bad weather conditions \nand signals the drivers to stop or return to the pit im", "ditions \nand signals the drivers to stop or return to the pit immediately, depending \non the situation.  \n \n4. Red & Yellow Striped Flag : It indicates that the cond itions of the track \nhave been modified by car debris, spilled oil or sand and could cause", "been modified by car debris, spilled oil or sand and could cause \nproblems like loss of control and reduced grip.  \n \n5. White Flag : It is displayed at the end of free practice sessions (Friday & \nSaturday) on the last corner and pit strai ght, indicating", "ay & \nSaturday) on the last corner and pit strai ght, indicating to the drivers that \nother drivers are engaged in practice on pit straight.  \nInstruction Flags  \nThese flags communicate with only one driver at a time and are of 5 types – \n1.  Black Flag :", "only one driver at a time and are of 5 types – \n1.  Black Flag : It is shown to impose penalty when a driver has broken some  \nrules and instruct the driver to get back to the pit.  \n \n2.  Black Flag with Orange Circle : It indicates that a car is being as", "ck Flag with Orange Circle : It indicates that a car is being asked to \nreturn to the cockpit due to technical problems like fuel leak, water leak or \noil leak, that might interfere with the proceedings of the race.  \n Formula One  \n \n13 \n \n \n3.  Per-bend ", "roceedings of the race.  \n Formula One  \n \n13 \n \n \n3.  Per-bend black/white flag : One diagonal of this flag is black and the \nother diagonal is white and is an indication of penalty on the driver due to \nlack of sportsmanship behavior.  \n \n4.  Black flag ", "iver due to \nlack of sportsmanship behavior.  \n \n4.  Black flag with white cross : This flag is black wi th two white diagonal \ncrosses and is waved when a driver ignores other black flags and instructs \nthe driver that his car is not scoring anymore.  \n \n", " instructs \nthe driver that his car is not scoring anymore.  \n \n5.  Blue Flag : It indicates to the driver that another faster car is coming \ntowards his direction and that he s hould make way for the faster car.  \nThe Chequered Flag  \nThe chequered flag i", " for the faster car.  \nThe Chequered Flag  \nThe chequered flag is waved at the finish line, indicating that the race is officially \nover. \n \n \n \n Formula One  \n \n14 \n \n \nA Formula One Grand Prix takes place over a weekend i.e., on 3 days - Friday, \nSaturda", "ix takes place over a weekend i.e., on 3 days - Friday, \nSaturday and Sunday. Different events take place on each of these 3 days. They \nare - \n \n Friday - Free Practice Sessions  \n \n Saturday - Free Practice Session plus Qualifying Session  \n \n Sunday ", "ay - Free Practice Session plus Qualifying Session  \n \n Sunday - Race Day  \nPractice Sessions  \nEvery Grand Prix begins with 3 free practice sessions, with 2 of them held on \nFriday; each of 90 minutes, one in the morning and the other in the afternoon. \n", "90 minutes, one in the morning and the other in the afternoon. \nThe last practice session takes place on Saturday.  \n \nDrivers other than regular drivers, called third drivers can participate in Friday  \npractice sessions in place of the regular driver. Th", "in Friday  \npractice sessions in place of the regular driver. The third drivers are usually \nnewcomers, trying to gain experience and exposure at such events.  \nQualifying Sessions  \nThe second day, Saturday, begins with the 3rd practice session in the mor", "d day, Saturday, begins with the 3rd practice session in the morning, \nfor a duration of one hour. The qualifying session follows in the afternoon and this \nsession is used to determine the starting order for the race day (Sunday).  \n \nThe qualifying sessi", "arting order for the race day (Sunday).  \n \nThe qualifying session lasts one hour and is divided into 3 knock -out stages - Q1, \nQ2, Q3, with sma ll intervals in between.  \n \nQ1 lasts 18 minutes and all 20 cars race on the circuit. Of these the five slowes", "es and all 20 cars race on the circuit. Of these the five slowest \ncars are eliminated and they occupy the places - 16, 17,18,19,20, on the grid.  \n \nQ2 begins after a brief interval with 16 cars and lasts 15 minutes.  Again, the five \nslowest cars are eli", "ars and lasts 15 minutes.  Again, the five \nslowest cars are eliminated and they occupy the places - 11, 12,13,14,15, on the \ngrid. \n \nFinally , Q3 begins with the 10 remaining cars and is 12 minutes long and fill the \nremaining 10 positions on the grid. T", "minutes long and fill the \nremaining 10 positions on the grid. The fastest driver occupies 'pole  position', a \nposition on the grid that is considered best to begin a game.  \nRace Day  \nThe main event of a Grand Prix, the race day is held on a Sunday afte", "ain event of a Grand Prix, the race day is held on a Sunday afternoon.  7. FORMULA ONE – GRAND PRIX FORMAT  Formula One  \n \n15 \n \n \nThe present system of Formula One World Championship points scoring was \nadopted in 2010 and has been continuing since.  \n \n", "scoring was \nadopted in 2010 and has been continuing since.  \n \nAccording to this system, the top 10 drivers at the end of each Grand Prix will \nreceive points based on the positions th ey finished and these points will contribute \ntowards determining both", "ished and these points will contribute \ntowards determining both, the World Drivers’ and World Constructors’ \nChampionships at the end of the season.  \n \nThe winner receives 25 points (25 Drivers' Championship points as well as 25 \nConstructors' Championsh", "ers' Championship points as well as 25 \nConstructors' Championsh ip points) and other drivers receive points according to \nthe following table:  \n \n1st place  25 points  \n2nd place  18 points  \n3rd place  15 points  \n4th place  12 points  \n5th place  10 po", " \n3rd place  15 points  \n4th place  12 points  \n5th place  10 points  \n6th place  8 points  \n7th place  6 points  \n8th place  4 points  \n9th place  2 points  \n10th place  1 point  \n \nIn order to receive points, a driver must be classified as a finisher. Fo", "to receive points, a driver must be classified as a finisher. For this, the \ndriver must have completed 90% of the distance covered by the winner, \nregardless of whether he completes the race or not.  \n \nIf a race is stoppe d or cannot be restarted due to ", "or not.  \n \nIf a race is stoppe d or cannot be restarted due to difficult weather conditions or \nany other circumstances, the top 10 finishers will get half the points given in the \ntable, provided the winner has covered 75% of the race distance.  \n \nIf bo", "vided the winner has covered 75% of the race distance.  \n \nIf both cars of a  team finish in the top 10, they both contribute to the Constructors ’ \nChampionship points.  \n \nIf a driver changes teams in between a season, the points he gained with the \nprev", "s teams in between a season, the points he gained with the \nprevious team will still be added to his Drivers' points. However, the Constructors' \npoints go to the respective teams.  \n \n \n \n 8. FORMULA ONE RACING – POINTS SYS TEM  Formula One  \n \n16 \n \n \nIn", " FORMULA ONE RACING – POINTS SYS TEM  Formula One  \n \n16 \n \n \nIn Formula One racing  up to 4 drivers can be used by teams in a season.  Following \nare some of the charismatic  and fastest drivers of all times  in the h istory of F1 \nracing.  \nWorld Drivers", "ers of all times  in the h istory of F1 \nracing.  \nWorld Drivers’ Championship Award  \nThe driver , who scores the most points in a Formula One World Championship \nseason, is awarded  the Formula One World Driver ’s Championship .  \nFormula One has produce", "ula One World Driver ’s Championship .  \nFormula One has produced some greatest sportsmen and legends . There will \nalways be the argument  of who is the best F1 driver, but here are some of the \nbest F1 drivers of all time.  \n \n \nMichael Schumacher , the ", "he \nbest F1 drivers of all time.  \n \n \nMichael Schumacher , the living legend and \nthe greatest Formula 1 driver, is the winner of \n7 world championships for the year 1994, \n1995, 2000, 2001, 2002, 2003 and 2004 . Other \nthan winning maximum championships,", "2002, 2003 and 2004 . Other \nthan winning maximum championships, his \nother records include fastest laps and \nmaximum number of races won during a single \nseason. Schumacher, is the only F1 driver to \nhave made history by finishing in the top thr ee \nrank ", "iver to \nhave made history by finishing in the top thr ee \nrank in every race of a season. Formula One \nofficial website quotes him as “statistically the \ngreatest driver the sport has ever seen”.  \n \n \n \n \nAyrton  Senna , was the most successful and \nlead", "en”.  \n \n \n \n \nAyrton  Senna , was the most successful and \nleading driver of the modern era. Senna, who \nunfortunately lost his life  in an accident leading \nthe San Marino Grand Prix in 1994, won three \nchampionships in the year 1988, 1990, and \n1991. Du", ", won three \nchampionships in the year 1988, 1990, and \n1991. During his short career, he was \nacclaimed for qualifying speed over one lap and \nwet weather performances. He held the record, \nfor most pole  positions for most pole positions \nduring the peri", "or most pole  positions for most pole positions \nduring the period 1989 -2006.  \n \n \n \n \n 9. FORMULA ONE – CHAMPIONS  \nFormula One  \n \n17 \n \n \nJuan Manuel Fangio , reigned the first decade of F1 racing, having won the world \nchampionship five times in the ", "F1 racing, having won the world \nchampionship five times in the year 1951, 1954, 1955, 1956 and 1957 . This record \nstood unbeaten for 47 ye ars till it was beaten by Michael Schumacher. Fangio also \nholds the record of reserving the highest winning percen", "o also \nholds the record of reserving the highest winning percentage (46.15) in F1, \nwinning 24 races out of the 52 races that he entered into.  \n \n \nNiki Lauda , is three times F1 world champion to have won the races in the year \n1975, 1977 and 1984. He i", "ion to have won the races in the year \n1975, 1977 and 1984. He is the only accomplished driver to have won the \nchampionship for both Ferrari and McLaren.  \n \n \nAlain Prost , is the four -time F1 world champion. \nHe held the record of maximum Grand Prix \nc", " F1 world champion. \nHe held the record of maximum Grand Prix \nconquests during the  period 1987 -2001. Out of \nthe total 202 races that he entered into, Prost \nwon 52 of them. He was the recipient of \nthe World Sports Awards of the Century  in the \nmotor ", "pient of \nthe World Sports Awards of the Century  in the \nmotor sport category  in 1999.  \n \n \n \n \n \n \nSebastian Vettel , one of the most successful F1 \ndriver, is the four -time winner of F1 world \nchampionship for consecutive years 2010, 2011, \n2012 and ", "world \nchampionship for consecutive years 2010, 2011, \n2012 and 2013. In 2009, Vettel was declared as \nthe youngest driver ever to have finished the \nworld championship as a runner -up. He also went \non to become the youngest driver to  have won \nhis first", "o went \non to become the youngest driver to  have won \nhis first world championship in 2010.   \n \nConstructors’ Championship Award  \nThe constructor, who scores the most points in a Formula One World \nChampionship season, is awarded the Formula One  World ", "e World \nChampionship season, is awarded the Formula One  World Constructor’s \nChampionship. The different cases for  awarding this title are:  \n \n If the chassis  and engine of a car is constructed by the same entity, then \nthe car’s make is the name of ", "tructed by the same entity, then \nthe car’s make is the name of that one constructor. Eg: Toyota, Ferrari, etc, \nand the Constructor’s championship is given to that one constructor.  \n \n If the  chassis and engine of a car is constructed by 2 separate ent", "he  chassis and engine of a car is constructed by 2 separate entities, then \nthe car’s make is also taken as two separate makes and points are scored \nindividually. Eg: Lotus -Climax McLaren -Mercedes, etc. In this case , the \nConstructor’s championship is", "Mercedes, etc. In this case , the \nConstructor’s championship is given to  the maker of the chassis . \nFormula One  \n \n18 \n \n \nCurrent World Constructors’ Champion  \nThe Formula  One World Constructors' Champion for 2014 is Mercedes . \nList of Constructors", "structors' Champion for 2014 is Mercedes . \nList of Constructors for 2015 Season  \nS. No.  Constructor  Engine  Country  \n1 Ferrari  Ferrari  Italy \n2 Force India  Mercedes  India \n3 Lotus  Mercedes  United Kingdom  \n4 Manor  Ferrari  United Kingdom  \n5 Mc", "rcedes  United Kingdom  \n4 Manor  Ferrari  United Kingdom  \n5 McLaren  Honda  United Kingdom  \n6 Mercedes  Mercedes  Germany  \n7 Red Bull  Renault  Austria  \n8 Sauber  Ferrari  Switzerland  \n9 Toro Rosso  Renault  Italy \n10 Williams  Mercedes  United Kingd", " Toro Rosso  Renault  Italy \n10 Williams  Mercedes  United Kingdom  \n \n "]